9/data/attachments/8d8b133c6fa6d7a8.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_81c8aa6b-f2e9-4484-97ad-af51b585e73e</nif:username>
            <nif:friendToBeAdded>Joshua_drop_Friend_1754_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>